Hi guys. Thanks for looking into this!

@manicminer I was trying to create this group with one principal and with a different principal in the owners.
If I try to create it without any owners defined, still doesn't work, but with the same error:

## No Owners:
```hcl
Terraform will perform the following actions:

  # azuread_group.this will be created
  + resource "azuread_group" "this" {
      + description             = "Test azuread_group Module"
      + display_name            = "azuread_group-test"
      + id                      = (known after apply)
      + mail_enabled            = (known after apply)
      + members                 = (known after apply)
      + name                    = (known after apply)
      + object_id               = (known after apply)
      + owners                  = (known after apply)
      + prevent_duplicate_names = false
      + security_enabled        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + config = {
      + description             = "Test azuread_group Module"
      + display_name            = "azuread_group-test"
      + members                 = []
      + owners                  = []
      + prevent_duplicate_names = null
    }
  + this   = (sensitive value)
azuread_group.this: Creating...
│ Error: Creating group "azuread_group-test"
│ 
│   with azuread_group.this,
│   on main.tf line 11, in resource "azuread_group" "this":
│   11: resource "azuread_group" "this" {
│ 
│ GroupsClient.BaseClient.Post(): unexpected status 400 with OData error:
│ Request_BadRequest: Request contains a property with duplicate values.
```

## Different owner
```hcl
Terraform will perform the following actions:

  # azuread_group.this will be created
  + resource "azuread_group" "this" {
      + description             = "Test azuread_group Module"
      + display_name            = "azuread_group-test"
      + id                      = (known after apply)
      + mail_enabled            = (known after apply)
      + members                 = (known after apply)
      + name                    = (known after apply)
      + object_id               = (known after apply)
      + owners                  = [
          + "********-****-****-****-********fc56",
        ]
      + prevent_duplicate_names = false
      + security_enabled        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ config = {
      ~ owners                  = [
          + "********-****-****-****-********fc56",
        ]
        # (4 unchanged elements hidden)
    }
  + this   = (sensitive value)
azuread_group.this: Creating...
╷
│ Error: Creating group "azuread_group-test"
│ 
│   with azuread_group.this,
│   on main.tf line 11, in resource "azuread_group" "this":
│   11: resource "azuread_group" "this" {
│ 
│ GroupsClient.BaseClient.Post(): unexpected status 400 with OData error:
│ Request_BadRequest: Request contains a property with duplicate values.
```

```sh
➜ az account show                          
{
  "environmentName": "AzureCloud",
  "id": "********-****-****-****-********6d29",
  "isDefault": true,
  "name": "N/A(tenant level account)",
  "state": "Enabled",
  "tenantId": "********-****-****-****-********6d29",
  "user": {
    "name": "*@*.com",
    "type": "user"
  }
}
```

The error is the same in Azure Portal:
```
Microsoft.Online.DirectoryServices.DirectoryValueExistsException
```